Инвентаризация_IT/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчетныеЗаписи</name>
    <attributes>
      <name>УчетнаяЗапись</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Логин</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пароль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заблокирована</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Инвентаризация_IT/src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
//@skip-check module-structure-method-in-regions
&НаКлиенте
Функция СформироватьТекстНеобходимыхДействий(УчетныеЗаписи)
// Формируем текст для вывода
  ТекстДляВывода = "1. Заблокировать учетные записи: " + Символы.ПС;

  // Счетчик заблокированных учетных записей
  КоличествоЗаблокированных = 0;

  // Сначала проверяем, есть ли строки в табличной части
  Если УчетныеЗаписи.Количество() = 0 Тогда
    ТекстДляВывода = "Информация об учетных записях отсутствует";
  // Если строки есть, проверяем, все ли учетные записи заблокированы
  ИначеЕсли КоличествоЗаблокированных = УчетныеЗаписи.Количество() Тогда
    ТекстДляВывода = "Все учетные записи заблокированы";
  Иначе
    // Перебираем строки табличной части
    Для Каждого СтрокаТабличнойЧасти Из УчетныеЗаписи Цикл
      // Проверяем, заблокирована ли учетная запись
      Если СтрокаТабличнойЧасти.Заблокирована = Ложь Тогда
        ТекстДляВывода = ТекстДляВывода + "- " + СтрокаТабличнойЧасти.УчетнаяЗапись + " " + СтрокаТабличнойЧасти.Логин + " " + Символы.ПС;
      Иначе
        КоличествоЗаблокированных = КоличествоЗаблокированных + 1;
      КонецЕсли;
    КонецЦикла;

    // Проверяем еще раз, все ли учетные записи заблокированы, 
    // после того как прошли по циклу
    Если КоличествоЗаблокированных = УчетныеЗаписи.Количество() Тогда
      ТекстДляВывода = "Все учетные записи заблокированы";
    КонецЕсли;
  КонецЕсли;

  Возврат ТекстДляВывода;
КонецФункции



//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура НеобходимыеДействияНажатие(Элемент)
	// Проверяем, что кликнули по нашей гиперссылке
  Если Элемент = Элементы.НеобходимыеДействия Тогда
    // Вызываем процедуру для формирования текста
    ТекстДляВывода = СформироватьТекстНеобходимыхДействий(Объект.УчетныеЗаписи);

    Элементы.СписокНеобходимыхДействий.Заголовок = ТекстДляВывода;
  КонецЕсли;
КонецПроцедуры


//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура УчетныеЗаписиПриИзменении(Элемент)
	// Вызываем процедуру для формирования текста
  ТекстДляВывода = СформироватьТекстНеобходимыхДействий(Объект.УчетныеЗаписи);

  Элементы.СписокНеобходимыхДействий.Заголовок = ТекстДляВывода;
КонецПроцедуры



//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура УстановитьВидимость()
	Уволен = Объект.Уволен;
	Элементы.НеобходимыеДействия.Видимость = Уволен;
	Элементы.СписокНеобходимыхДействий.Видимость = Уволен;
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура УволенПриИзменении(Элемент)
	УстановитьВидимость()
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость()
КонецПроцедуры
